app/Models/DetalleModel.php

    public function create($datos)
    {
        $detalles = $this->db->table('detalles');
        return $detalles->insert($datos);
---
INSERT INTO `detalles` (`idFactura`, `idProducto`, `cantidad`) VALUES ('52', 10, 2)