app/Models/FacturaModel.php

    public function create($datos)
    {
        $productos = $this->db->table('productos');
        return $productos->insert($datos);
---
INSERT INTO `facturas` (`idUsuario`, `fecha`) VALUES ('34', '2022-06-16 13:09:14')

    public function readForProducto($data)
    {
        $Usuario = $this->db->table('productos');
        $Usuario->where($data);
        return $Usuario->get()->getResultArray();
---
SELECT * FROM `facturas` WHERE idUsuario = 39