app/Models/ProductoModel.php

SELECT * FROM `productos` WHERE id = 10
---
    public function readForUsuario($data){

        $Usuario = $this->db->table('productos');
        $Usuario->where($data);
        return $Usuario->get()->getResultArray();