app/Models/UsuarioModel.php

    public function readForUsuario($data){

        $usuario = $this->db->table('usuarios');
        $usuario->where($data);
        return $usuario->get()->getResultArray();
---
SELECT * FROM `usuarios` WHERE id = 34